[{"Node":"rootNavigation.learner.rulesOfTheRoad.theDriver.learnerDrivers","ImageName":"","Heading":"What does the Learner&#39;s Licence entitle me to do? ","Description":"If you have a learner&#39;s licence you may drive a car, subject to the following rules:<ul><li>You must carry your learner&#39;s licence with you at all times while driving</li><li>You need to have a supervisor with you at all times who:<ul><li>Has a valid licence for the  same class of vehicle</li><li>Has to sit in the passenger seat or behind the driver&#39;s seat if s/he can&#39;t sit in the passenger seat</li><li>Can&#39;t be under the influence of drugs or alcohol</li></ul></li><li>You don&#39;t have to use L plates by law, but other drivers are more likely to be patient with you if you do (remember to remove them after each driving session)</li><li>You may have other passengers in the car, but not paying passengers</li><li>You may tow a caravan/trailer</li><li>You may go on freeways.</li></ul>"},{"Node":"rootNavigation.learner.rulesOfTheRoad.theDriver.learnerDrivers","ImageName":"","Heading":"How long is the Learner&#39;s Licence valid for? ","Description":"18 months from the date on which you passed your test."},{"Node":"rootNavigation.learner.rulesOfTheRoad.theDriver.learnerDrivers","ImageName":"","Heading":"Requirements for a Learner&#39;s Licence","Description":"<ul><li>For light motor vehicles you need to be 17 years or older. </li><li>You may not have been disqualified from getting a Learner&#39;s or Driver&#39;s Licence by a court of law. </li><li>You may not apply if your licence has been suspended and you are still within the period of suspension, or your licence has been endorsed or cancelled.</li><li>You may not apply if you already have a licence for same class of vehicle. </li><li>You must have no physical or mental disability that would make it difficult or dangerous for you to drive (including uncontrolled epilepsy or diabetes). If you already have a licence and you become aware of such a defect it is your responsibility to report it to the authorities within 21 days of becoming aware of it.</li></ul>"},{"Node":"rootNavigation.learner.rulesOfTheRoad.theDriver.learnerDrivers","ImageName":"","Heading":"Eyesight ","Description":"<ul><li>You can&#39;t hold a learner&#39;s licence unless you have a Snellen visual acuity rating of <ul><li>6/12 (20/40) in each eye</li><li>or if one eye has a rating of less than 6/12, then other eye must be 6/9 (20/30) </li></ul></li><li>You may take the eye test wearing glasses/contacts. If you do then your licence will be endorsed and you will need to wear your glasses or contacts whenever you drive. </li><li>If you fail the eye test at the traffic department you can go to be retested by a registered optometrist. If according to their test you pass then this has to be accepted by the traffic department.</li></ul>"},{"Node":"rootNavigation.learner.rulesOfTheRoad.theDriver.learnerDrivers","ImageName":"","Heading":"Booking a Learner&#39;s Licence test ","Description":"<ul><li>Go in person to book your test at the Learner&#39;s Licence Test Centre.</li><li>Take the prescribed fee. This varies per province, so contact your test centre to find out what the fee is.</li><li>Take your valid ID book.</li><li>Take two ID photos (they can be colour or black and white).</li><li>At the test centre you will fill in Form LL1.</li><li>Your eyes will be tested at the test centre.</li><li>You will be given a date on which to come back for your test.</li></ul>"},{"Node":"rootNavigation.learner.rulesOfTheRoad.theDriver.learnerDrivers","ImageName":"","Heading":"How are you tested?","Description":"<ul><li>Your Learner&#39;s Licence test consists of a written theory test covering three main sections:<ul><li>Rules of the road, traffic control signals and principles of defensive driving</li><li>Road traffic signs and road markings</li><li>Motor vehicle controls</li></ul></li><li>All of the questions are multiple choice. </li><li>You need to do well in all three sections. Even if you have a high score overall if you have done badly in one of the sections you could fail. </li><li>You will receive a test booklet of questions, and a sketch booklet with pictures in it, for example road signs and situations on the road. Some of the test questions refer to pictures in the sketch booklet. </li></ul>"},{"Node":"rootNavigation.learner.rulesOfTheRoad.theDriver.driversDuties","ImageName":"","Heading":"Your general duties","Description":"<ul><li>Always stay in control of your vehicle</li><li>Keep a clear view of road ahead</li><li>The front and back windscreen and rear-view mirrors must be clean and not cracked</li><li>Reverse when only when safe, and for as short a distance as possible</li><li>No part of your body may be out of the vehicle, except for giving hand signals</li><li>Only pull off when it is safe and when it will not interfere with traffic</li><li>Keep a safe following distance so you can stop in time (2 seconds is the normal following distance) </li><li>Give way immediately to emergency vehicles sounding sirens</li><li>You may not run the engine if<ul><li>The vehicle is not under your control (you are out of the car) </li><li>Your fuel cap is off</li><li>The car is smoking excessively </li></ul></li><li>If you leave the car, you have to have the parking brake on</li><li>Instructions from a traffic officer always take precedence over any rule of the road or road sign/marking</li><li>Keep to the left on two way roads. On a one way, you can go on the right</li><li>Have your driver&#39;s licence on you at all times</li><li>Always drive with consideration for the safety of all people and property on and alongside the road. </li></ul>"},{"Node":"rootNavigation.learner.rulesOfTheRoad.theDriver.driversDuties","ImageName":"","Heading":"Your duties regarding passengers","Description":"<ul><li>Don&#39;t allow people or animals to obstruct your view or ability to control the vehicle or give signals clearly</li><li>Don&#39;t allow anyone to take control of the steering or controls</li><li>A passenger may not drive/steer the vehicle unless it is clear that the driver cannot control the vehicle any more</li><li>No person (or animal) can go on the roof/step/running board when the vehicle is in motion </li><li>Passengers may not have any part of the body out of the car</li><li>Make sure passengers know how to work the doors and seatbelt release</li><li>Make sure they wear seatbelts</li><li>Don&#39;t let them get in or out when the vehicle is moving or it&#39;s not safe</li><li>Passengers may only go on the back of a truck or van if the sides are at least<ul><li>450mm high if sitting (350mm in KZN) </li><li>900mm high if standing (1250mm in KZN) </li></ul></li><li>The above rule doesn&#39;t apply to people being transported for work</li><li>Don&#39;t overload passengers. Each should have at least 380mm of seat width</li></ul>"},{"Node":"rootNavigation.learner.rulesOfTheRoad.theDriver.accidents","ImageName":"","Heading":"For all accidents","Description":"<ul><li>Stop immediately</li><li>Find out if anyone is injured. How badly? </li><li>Establish what damage was caused</li><li>If no-one is hurt, move the vehicles if they&#39;re causing an obstruction</li><li>Use emergency triangles if necessary</li><li>Exchange as much information as possible: <ul><li>Name/address/ID number of all drivers involved</li><li>Name/address/ID number of the owners of all vehicles involved</li><li>Make/model/colour/registration number of all vehicles involved</li><li>Details of insurance companies of all vehicles involved</li><li>If there were any witnesses, take their details too</li></ul></li><li>Go to a police station within 24 hours with your licence to report the accident (unless the police were at the scene) </li><li>Don&#39;t drink/take drugs before reporting the accident</li></ul>"},{"Node":"rootNavigation.learner.rulesOfTheRoad.theDriver.accidents","ImageName":"","Heading":"If someone was injured or killed in an urban area","Description":"<ul><li>Call the police immediately</li><li>Call an ambulance if necessary</li><li>Help injured people</li><li>Don&#39;t move the vehicles unless a traffic officer tells you to, or unless they&#39;re completely obstructing traffic, and only after marking their positions clearly on the road. Move them just enough to let traffic pass. </li><li>Vehicles can&#39;t be removed from the scene without permission from the driver, owner or an authorised person</li></ul>"},{"Node":"rootNavigation.learner.rulesOfTheRoad.theDriver.alcoholDrugs","ImageName":"","Heading":"The law says","Description":"<ul><li>You may not drive or even sit in the driver&#39;s seat with the engine on if<ul><li>You&#39;ve taken narcotic drugs (even prescription drugs) </li><li>You are a normal driver and you have a blood alcohol level of over 0.05g per 100ml blood (0.24mg per 1000 ml breath) </li><li>You are a professional driver and you have a blood alcohol level of over 0.02g per 100ml blood (0.10mg per 1000 ml breath) </li></ul></li><li>If asked by a law enforcement officer, you may not refuse to give a blood or breath sample</li><li>You may not smoke till the sample has been taken</li><li>At the time of this CD being printed, there was a proposal to bring in new laws that make it illegal for drivers to have any alcohol at all in their systems for the first three years after getting their licence. Please check to see if this law has come into effect by the time you get your licence.</li></ul>"},{"Node":"rootNavigation.learner.rulesOfTheRoad.theDriver.alcoholDrugs","ImageName":"","Heading":"Factors that affect blood alcohol levels","Description":"If two people drank the same amount they could have different blood alcohol levels, so it&#39;s impossible to say exactly what all people can drink to stay under the limit. Some of the factors that affect blood alcohol levels are:<ul><li>Gender: in general, males&#39; blood alcohol levels go up more slowly than females&#39;</li><li>Weight: the lighter you are, the faster your blood alcohol level goes up</li><li>General level of health: if you are ill it goes up faster</li><li>How fast you&#39;ve been drinking (slower is better) </li><li>What else you&#39;ve eaten or drunk, or other drugs you have taken</li></ul>"},{"Node":"rootNavigation.learner.rulesOfTheRoad.theDriver.alcoholDrugs","ImageName":"","Heading":"General guidelines for staying under the limit","Description":"<ul><li>As mentioned, it is not possible to say exactly how many drinks you can have before being over the limit, because it depends on so many factors. Rather drink less and be sure you are under. But to give you an idea, you should stay below:<ul><li>1-2 drinks for females (not drinking faster than 1 drink per hour) </li><li>2-3 drinks for males (not drinking faster than 1 drink per hour) </li></ul></li><li>Alcohol takes time to break down in your blood, so if you had a heavy night and didn&#39;t drive, you could still be over the limit if you wake up the next morning and drive. </li><li>After you stop drinking allow at least an hour for each drink you had to break down. </li></ul>"},{"Node":"rootNavigation.learner.rulesOfTheRoad.theDriver.alcoholDrugs","ImageName":"","Heading":"One &#34;drink&#34; is","Description":"<ul><li>One glass table wine (125ml) </li><li>One can/bottle beer (340ml) </li><li>One shot of spirits (25ml) </li></ul>"},{"Node":"rootNavigation.learner.rulesOfTheRoad.theDriver.cellphones","ImageName":"","Heading":"","Description":"<ul><li>You may not drive while holding a cellphone with a hand or any other part of your body.</li><li>Use a car phone, headset or hands free kit.</li><li>This rule applies to any communications equipment, such as hand-held radios.</li><li>It does not apply to emergency personnel on duty.</li></ul>"},{"Node":"rootNavigation.learner.rulesOfTheRoad.theRoad.damageToPublicRoads","ImageName":"","Heading":"Hindering traffic","Description":"<ul>\n<li>You are not allowed to hinder or disrupt traffic flow on a public road.</li>\n<li>You may not put anything on the road that would do so.</li>\n</ul>\n"},{"Node":"rootNavigation.learner.rulesOfTheRoad.theRoad.damageToPublicRoads","ImageName":"","Heading":"Racing/sport","Description":"You must get written permission from the provincial authorities before organizing or taking part in any of the following activities on a public road:\n<ul><li>Race</li>\n<li>Speed/reliability trial </li>\n<li>Sports meeting</li>\n <li>Any activity which could disrupt or endanger normal traffic flow</li></ul>\n"},{"Node":"rootNavigation.learner.rulesOfTheRoad.theRoad.damageToPublicRoads","ImageName":"","Heading":"Damage to public roads","Description":"<ul><li>You may not drag or spin your wheels.</li>\n<li>You may not use chocks or shoes between your wheels and the road.</li>\n<li>You may not damage the surface of the road in any way.</li>\n<li>You may not move a vehicle on the pavement (not even pushing or pulling it).</li>\n<li>Don&#39;t put fuel, oil, or any objectionable material on the road, roadside or in running water.</li>\n<li>Don&#39;t drag anything on the road surface that could damage it or cause danger or damage to road users.</li></ul>\n"},{"Node":"rootNavigation.learner.rulesOfTheRoad.theRoad.damageToPublicRoads","ImageName":"","Heading":"Lights visible from public roads","Description":"<ul><li>You may not use or erect a lamp or lighting device which is visible from a public road in a way that endangers safety.</li>\n<li>This rule refers to lights put up alongside roads, not lights on vehicles.</li></ul>\n"},{"Node":"rootNavigation.learner.rulesOfTheRoad.theRoad.peopleOnTheRoad","ImageName":"","Heading":"Trading on public roads","Description":"Unless it is in a demarcated area, you may not sell or display goods on or alongside a public road:\n<ul><li>In an urban area:\n<ul><li>Not within 180m of a level crossing</li> \n<li>Not within 180m of a road sign warning of a blind corner or rise</li>\n<li>Not within 5m of an intersection</li></ul></li>\n<li>Not at all outside an urban area</li></ul>\n"},{"Node":"rootNavigation.learner.rulesOfTheRoad.theRoad.peopleOnTheRoad","ImageName":"","Heading":"Pedestrian crossings ","Description":"<ul><li>If a pedestrian crossing is guarded (with traffic lights), pedestrians must obey the lights (they can&#39;t cross unless indicated by the lights).</li>\n<li>If it is not guarded, then pedestrians have right of way and cars must stop for them.</li>\n<li>Pedestrians may not enter the crossing suddenly making it difficult for cars to stop safely.</li>\n<li>Drivers must stop or slow down if there are pedestrians on a crossing or entering it from the same side as the driver.</li>\n<li>No other car can overtake someone stopped at a pedestrian crossing.</li></ul>\n"},{"Node":"rootNavigation.learner.rulesOfTheRoad.theRoad.peopleOnTheRoad","ImageName":"","Heading":"Duties of pedestrians ","Description":"<ul><li>If there is a pavement, pedestrians may not walk on the road, except to cross it.</li>\n<li>If there is no pavement, pedestrians must walk facing oncoming traffic, as close as possible to the right edge of the road.</li>\n<li>Pedestrians may only cross the road after making sure it is safe, and then doing it as quickly as possible. </li>\n<li>They must cross at a pedestrian crossing or intersection, or else at least 50m away from them.</li></ul>\n"},{"Node":"rootNavigation.learner.rulesOfTheRoad.theRoad.peopleOnTheRoad","ImageName":"","Heading":"Duties of cyclists ","Description":"<ul><li>You must be seated astride the saddle.</li>\n<li>You must always have at least one hand on the handle bars.</li>\n<li>You can&#39;t have another person, animal or object on the bike that obstructs your view or control.</li>\n<li>All the wheels have to be in contact with the road all the time.</li>\n<li>You may not be holding on to any other moving vehicle.</li>\n<li>You must ride in single file unless overtaking another cyclist; only one person at a time may overtake.</li>\n<li>You can&#39;t make another cyclist swerve from side to side.</li>\n<li>If there is a part of the road set aside for use by cyclists you have to use that part, and can&#39;t use any other.</li></ul>\n"},{"Node":"rootNavigation.learner.rulesOfTheRoad.theRoad.peopleOnTheRoad","ImageName":"","Heading":"Herding animals","Description":"<ul><li>Animals are not allowed to be on a public road in a place that is fenced/closed in on both sides, unless they are being:\n<ul><li>ridden</li>\n<li>used to draw a vehicle</li>\n<li>herded to another place</li></ul></li>\n<li>If you are herding animals, you must carry:\n<ul><li>A red flag 300mm square during the day</li>\n<li>A red light that can be seen 150m away during the night</li></ul></li>\n<li>If the herd is less than 10 animals, one flag/light is enough.</li>\n<li>If the herd is more than 10 animals, your warnings must be carried both ahead of and behind the herd.</li>\n<li>No animals at all are allowed on freeways.</li></ul>\n"},{"Node":"rootNavigation.learner.rulesOfTheRoad.theRoad.vehiclesOnTheRoad","ImageName":"","Heading":"Animal drawn vehicles","Description":"<ul><li>All animal drawn vehicles on public roads should have the owner&#39;s name and address clearly marked on them.</li>\n<li>The vehicle and harness have to be in a safe working condition.</li>\n<li>The animal and vehicle must always be under the control of a person (driving with reins or leading) unless they are tied up so that they can&#39;t move.</li>\n<li>Two animal drawn vehicles moving in the same direction can&#39;t be closer than 150m to each other, unless one is overtaking the other and will move away from it quickly.</li></ul>\n"},{"Node":"rootNavigation.learner.rulesOfTheRoad.theRoad.vehiclesOnTheRoad","ImageName":"","Heading":"Abandoned vehicles","Description":"<ul><li>A vehicle is considered to be abandoned if:\n<ul><li>It is parked in a no stopping or no parking area</li>\n<li>It has been left without moving in the same place on public road or at a testing station longer than 7 days (in an urban area)</li>\n<li>It has been left in the same place on public road longer than 24 hours (outside an urban area)</li>\n<li>It has no licence plate or a false plate</li>\n<li>It is causing a danger or obstruction</li>\n<li>There is no way to identify the owner</li></ul></li>\n<li>Abandoned vehicles can be towed or impounded.</li>\n<li>The owner has to cover all costs involved (unless the vehicle was stolen).</li>\n<li>The vehicle can be sold to cover costs if the owner can&#39;t be traced or does not recover the vehicle.</li></ul>\n"},{"Node":"rootNavigation.learner.rulesOfTheRoad.theRoad.vehiclesOnTheRoad","ImageName":"","Heading":"Convoys","Description":"No convoys of vehicles being delivered to a dealer or other person should travel at the following times:\n<ul><li>On weekends, from 18h00 on Friday evening to 06h00 on Monday morning</li>\n<li>On long weekends, from 18h00 on Friday evening (or Thursday evening if Friday is a public holiday) to 06h00 on Monday morning (or Tuesday morning if Monday is a public holiday)</li>\n<li>Over Christmas, from 18h00 the night before Christmas Day till 06h00 the morning after the Day of Goodwill</li></ul>\n"},{"Node":"rootNavigation.learner.rulesOfTheRoad.theRoad.freeways","ImageName":"","Heading":"Vehicles not allowed on freeways","Description":"<ul><li>Animal drawn vehicles</li>\n<li>Tractors (except for road construction/ maintenance)</li>\n<li>Pedal cycles (bicycle, tricycles, quadrucycles)</li>\n<li>Electrically powered motorcycles</li>\n<li>Motorcycles with engine capacity less than 50cc</li>\n<li>Motor tricycles/quadrucycle</li>\n<li>Vehicles less than 230 kg (mainly disabled vehicles)</li></ul>\n"},{"Node":"rootNavigation.learner.rulesOfTheRoad.theRoad.freeways","ImageName":"","Heading":"Actions not allowed on freeways","Description":"<ul><li>Hand signals (except in emergencies)</li>\n<li>Reversing</li>\n<li>Driving across dividers or islands</li>\n<li>Leaving animals behind or allowing them on the freeway</li>\n<li>You may not be on foot (walk), or stop your vehicle, unless:\n<ul><li>To obey a road sign or instruction from a traffic officer</li>\n<li>In a demarcated stopping/parking area</li>\n<li>For a reason beyond your control</li>\n<li>You are in the Citizen Force and you&#39;re on the left hand side of the freeway, between an offramp and an onramp</li>\n<li>To pick up or drop off  a Citizen Force member in area as per above</li>\n<li>Emergency personnel and maintenance crews on duty may stop vehicles and walk on freeways</li></ul></li></ul>\n"},{"Node":"rootNavigation.learner.rulesOfTheRoad.theCar.unauthorisedUse","ImageName":"","Heading":"","Description":"<ul><li>Don&#39;t drive, enter, climb on or tamper with a vehicle without the consent of the person lawfully in charge of the vehicle.</li>\n<li>Don&#39;t alter the chassis or engine number of a vehicle without consulting the registering authority.</li></ul>\n"},{"Node":"rootNavigation.learner.rulesOfTheRoad.theCar.lights","ImageName":"","Heading":"","Description":"<ul><li>You may not drive on a public road (even in the daytime) if any of your vehicle&#39;s lights aren&#39;t working or properly secured.</li>\n<li>Unless otherwise stated, all lights have to be able to be seen 150m away.</li></ul>\n"},{"Node":"rootNavigation.learner.rulesOfTheRoad.theCar.lights","ImageName":"","Heading":"Headlights: dipped beams","Description":"<ul><li>These must be on at the following times:\n<ul><li>between sunset and sunrise (including rear lights and number plate lights)</li>\n<li>or where visibility is not clear for 150m ahead (for example in rain, fog, dust, dim light).</li></ul></li>\n<li>Use dipped beams in urban areas or dense traffic.</li>\n<li>Your dipped beams slant down, and they may not hit the road more than 45m ahead.</li>\n<li>They should allow you to see a car or person 45m ahead of you.</li></ul>\n"},{"Node":"rootNavigation.learner.rulesOfTheRoad.theCar.lights","ImageName":"","Heading":"Headlights: main beams","Description":"<ul><li>Be aware that your brights can temporarily blind other drivers.</li>\n<li>Use them outside urban areas and when there is no oncoming traffic.</li>\n<li>Switch them off when you are directly behind someone.</li>\n<li>They should allow you to see a car or person 100m ahead of you.</li></ul>\n"},{"Node":"rootNavigation.learner.rulesOfTheRoad.theCar.lights","ImageName":"","Heading":"Parking lights","Description":"<ul><li>If there is only one parking lamp on your car it should be on the right.</li>\n<li>Parking lights must be used when you&#39;re parked: \n<ul><li>outside a demarcated parking area in an urban area</li>\n<li>more than 12m from a streetlight in a public road.</li></ul></li>\n<li>Parking lights cannot be used for driving.</li></ul>\n"},{"Node":"rootNavigation.learner.rulesOfTheRoad.theCar.lights","ImageName":"","Heading":"Adjustable spotlights","Description":"These may only be used by the following people (when they&#39;re on duty):\n<ul><li>Medical personnel</li>\n<li>Police</li>\n<li>Traffic control personnel</li>\n<li>Fire personnel</li>\n<li>Doctors or vets</li>\n<li>Breakdown trucks/electricity supply vehicles</li></ul>\n"},{"Node":"rootNavigation.learner.rulesOfTheRoad.theCar.lights","ImageName":"","Heading":"Brake lights (stop lamps)","Description":"<ul><li>Your brake lights have to be brighter than your rear lamps.</li>\n<li>They must be able to be seen in normal sunlight from 30m away.</li></ul>\n"},{"Node":"rootNavigation.learner.rulesOfTheRoad.theCar.lights","ImageName":"","Heading":"Indicators ","Description":"<ul><li>No vehicle may be used on a public road if it doesn&#39;t have working direction indicators visible from both front and back on both sides.</li>\n<li>They must be able to be seen in normal sunlight from 30m away.</li></ul>\n"},{"Node":"rootNavigation.learner.rulesOfTheRoad.theCar.lights","ImageName":"","Heading":"Emergency warning lights","Description":"<ul><li>Your emergency warning lights are actually your direction indicators, all flashing at the same time.</li>\n<li>You may only use them when:\n<ul><li>Your vehicle is stationary </li>\n<li>You are towing or being towed</li>\n<li>In emergency situation when your car is in motion, to warn other road users.</li></ul></li>\n<li>They have to be working for the car to be roadworthy.</li>\n<li>Be aware that when they are on you can&#39;t signal direction, so use hand signals when turning, for example when you are being towed.</li></ul>\n"},{"Node":"rootNavigation.learner.rulesOfTheRoad.theCar.lights","ImageName":"","Heading":"Rear reflectors","Description":"All cars on public roads must have two red reflectors on the back."},{"Node":"rootNavigation.learner.rulesOfTheRoad.theCar.lights","ImageName":"","Heading":"Lights on animal drawn vehicles","Description":"<ul><li>All animal drawn vehicles must have white lights on both sides of the front and red lights at both sides of the back.</li>\n<li>If a person is leading an animal drawn vehicle, the person has to stand at the head of the first animal with a white light.</li></ul>\n"},{"Node":"rootNavigation.learner.rulesOfTheRoad.theCar.seatBelts","ImageName":"","Heading":"","Description":"<ul><li>You may not use a vehicle on a public road unless all the seatbelts work.</li>\n<li>You may only remove seatbelts from the car for repair or replacement, and you can&#39;t use the car on a public road until the repair or replacement is complete.</li>\n<li>All seatbelts fitted in the car must be worn (front and back).</li>\n<li>If there is a seat with a seatbelt available, a passenger has to sit in it rather than sitting in a seat with no seatbelt.</li>\n<li>If a child restraint is available children must use that, otherwise they must use a seatbelt if available.</li>\n<li>If there is no seatbelt in the front passenger seat, anyone up to 14 years old (or shorter than 1.5m) must sit at the back.</li>\n<li>You don&#39;t have to wear a seatbelt if you&#39;re reversing.</li></ul>\n"},{"Node":"rootNavigation.learner.rulesOfTheRoad.theCar.tyres","ImageName":"","Heading":"","Description":"<ul><li>The tyre tread must be deeper than 1mm all over.</li>\n<li>You must see the pattern of the tread all over the tyre.</li>\n<li>There can be no:\n<ul><li>cuts on the side walls which are more than 10% of the tyre width, or longer than 25mm, whichever is greater</li>\n<li>lumps or bulges anywhere on the tyre</li>\n<li>inner cords, canvas or steel belts showing.</li></ul></li></ul>\n"},{"Node":"rootNavigation.learner.rulesOfTheRoad.theCar.otherEquipment","ImageName":"","Heading":"Steering","Description":"<ul><li>The steering wheel can&#39;t have excessive free play.</li>\n<li>This means that if the wheels are straight you musn&#39;t be able to turn the wheel more than 45 degrees before it starts turning the wheels to the left or right.</li></ul>\n"},{"Node":"rootNavigation.learner.rulesOfTheRoad.theCar.otherEquipment","ImageName":"","Heading":"Brakes ","Description":"<ul><li>You may not use a light motor vehicle on a public road if it does not have a service brake (foot brake) and a parking brake (handbrake).</li>\n<li>For a light motor vehicle, the service brakes need to be able to stop the car within 14m if you were travelling at 35km/h.</li>\n<li>The parking brake needs to be able to keep your car still with the engine disengaged on a gradient of up to 1:8.33.</li></ul>\n"},{"Node":"rootNavigation.learner.rulesOfTheRoad.theCar.otherEquipment","ImageName":"","Heading":"Anti-theft devices ","Description":"The following types of anti-theft devices are illegal:\n<ul><li>An anti-theft device that interferes with the brakes.</li>\n<li>An anti theft device that allows you to disconnect the steering wheel from the steering mechanism of the car.</li></ul>\n"},{"Node":"rootNavigation.learner.rulesOfTheRoad.theCar.otherEquipment","ImageName":"","Heading":"Windows and windscreens","Description":"<ul><li>The glass of the windows and windscreens must be clean and uncracked so that you can see out clearly.</li>\n<li>Any films or tinting materials must have no bubbles or tears.</li>\n<li>You are not allowed to use your car on a public road unless it has at least one windscreen wiper that works (the one directly in front of the driver).</li></ul>\n"},{"Node":"rootNavigation.learner.rulesOfTheRoad.theCar.otherEquipment","ImageName":"","Heading":"Mirrors","Description":"<ul><li>Light motor vehicles have to have at least one interior and one exterior (driver&#39;s side) mirror.</li>\n<li>Minibuses, buses and trucks have to have an exterior mirror on the passenger side as well.</li></ul>\n"},{"Node":"rootNavigation.learner.rulesOfTheRoad.theCar.otherEquipment","ImageName":"","Heading":"Doors","Description":"<ul><li>You have to have at least one door on the left and one on the right that can open and close both from the inside and outside.</li>\n<li>You may not drive with the doors open.</li></ul>\n"},{"Node":"rootNavigation.learner.rulesOfTheRoad.theCar.otherEquipment","ImageName":"","Heading":"Fuel cap","Description":"<ul><li>Your fuel cap has to be closed when you are using a public road.</li></ul>"},{"Node":"rootNavigation.learner.rulesOfTheRoad.theCar.otherEquipment","ImageName":"","Heading":"Speedometers","Description":"<ul><li>Your speedometer has to be in working order when you are using a public road.</li></ul>"},{"Node":"rootNavigation.learner.rulesOfTheRoad.theCar.otherEquipment","ImageName":"","Heading":"Reverse","Description":"<ul><li>Your car has to be able to go both forwards and backwards when you are using a public road.</li></ul>"},{"Node":"rootNavigation.learner.rulesOfTheRoad.theCar.otherEquipment","ImageName":"","Heading":"Exhausts","Description":"<ul><li>You may not drive with a broken silencer.</li>\n<li>You can&#39;t use your car on a public road if the exhaust smoke is a nuisance or obstructs the vision of other drivers.</li></ul>\n"},{"Node":"rootNavigation.learner.rulesOfTheRoad.theCar.otherEquipment","ImageName":"","Heading":"Noise","Description":"<ul><li>You may not use a vehicle that is making excessive noise (eg broken silencer) unless this is accidental, temporary or beyond your control.</li>\n<li>You may not have any accessories that are too noisy.</li></ul>\n"},{"Node":"rootNavigation.learner.rulesOfTheRoad.theCar.otherEquipment","ImageName":"","Heading":"Hooters","Description":"<ul><li>You are not allowed to use a car on a public road if the hooter is not working.</li>\n<li>It must be audible for at least 90m.</li>\n<li>It may not have a variable tone (tune).</li>\n<li>You may only use it to prevent an accident.</li></ul>\n"},{"Node":"rootNavigation.learner.rulesOfTheRoad.theCar.emergencyTriangles","ImageName":"","Heading":"","Description":"<ul><li>There must be a double edged red and white reflective triangle in all:\n<ul><li>Bakkies</li>\n<li>Trailers</li>\n<li>Caravans</li>\n<li>Vans</li>\n<li>Trucks</li>\n<li>Minibuses</li>\n<li>Buses</li></ul></li>\n<li>Use it when your vehicle is stationary on the roadway (unless in a designated area or stopped because of other traffic and with the driver still in it).</li>\n<li>Display it at least 45 m from your car in the direction from which traffic will approach, with the reflective side facing them.</li></ul>\n"},{"Node":"rootNavigation.learner.rulesOfTheRoad.theCar.transportingGoods","ImageName":"","Heading":"General rules for transporting goods on a vehicle","Description":"<ul><li>Any goods on a vehicle must be securely fastened.</li>\n<li>The load can&#39;t touch the road anywhere (only a static chain can touch the road).</li>\n<li>The load can&#39;t obscure the driver&#39;s view anywhere, including rear-view mirrors.</li>\n<li>The dimensions cannot be larger than:\n<ul><li>Height: half the height of the vehicle if carried on the roof (if you are carrying bicycles on the roof they can be higher)</li>\n<li>Height: 4.3m for goods vehicles</li>\n<li>Width: 2.5m wide at the widest point (2.6m for large trucks or buses)</li>\n<li>Length: can&#39;t project more than 1.8m from the end of the vehicle at the back and 300mm at the front.</li></ul></li></ul>\n"},{"Node":"rootNavigation.learner.rulesOfTheRoad.theCar.transportingGoods","ImageName":"","Heading":"Warning markings when transporting goods","Description":"<ul><li>Any load that projects more than 150mm from the sides of the vehicle or 300mm from the back must carry warning markings.</li>\n<li>If the load is less than 600mm wide it must be marked with:\n<ul><li>In the day, a single red flag (300mm square)</li>\n<li>At night, a single red reflector</li></ul></li>\n<li>If the load is more than 600mm wide it must be marked with:\n<ul><li>In the day, red flags (300mm square) at each corner</li>\n<li>At night, white reflectors/lights on each corner at the front</li>\n<li>At night, red reflectors/lights on each corner at the back</li>\n<li>At night, yellow reflectors/lights on each side.</li></ul></li></ul>\n"},{"Node":"rootNavigation.learner.rulesOfTheRoad.theCar.numberOfPassengers","ImageName":"","Heading":"","Description":"<ul><li>The number of people that can be carried in a vehicle depends on seat space.</li>\n<li>Each person must have at least 380mm of seat space.</li>\n<li>Children under 3 don&#39;t count.</li>\n<li>Children 3-6 can go on laps.</li></ul>\n"},{"Node":"rootNavigation.learner.rulesOfTheRoad.driving.speedLimits","ImageName":"","Heading":"For light motor vehicles ","Description":"<ul><li>In urban areas (towns and cities), the general speed limit is 60km/h.</li>\n<li>In rural areas and on national roads, the general speed limit is 100km/h.</li>\n<li>On freeways, the general speed limit is 120km/h.</li>\n<li>If there are road signs that give different speed limits to these then the road signs must be obeyed.</li></ul>\n"},{"Node":"rootNavigation.learner.rulesOfTheRoad.driving.speedLimits","ImageName":"","Heading":"For other vehicles ","Description":"<ul><li>Minibuses carrying paying passengers and passenger buses must never go faster than 100km/h.</li>\n<li>Vehicles with a gross vehicle mass of over 9 000kg (large trucks) must never go faster than 80km/h.</li>\n<li>Tractors on public roads may not go faster than 35km/h.</li></ul>\n"},{"Node":"rootNavigation.learner.rulesOfTheRoad.driving.stopping","ImageName":"","Heading":"<span class=\"contentHeading2\">You must stop:</span>","Description":"<ul><li>To obey:\n<ul><li>A traffic officer</li>\n<li>Scholar patrol person</li>\n<li>Person driving/riding/leading animals</li>\n<li>A road marking</li>\n<li>A road sign.</li></ul></li>\n<li>If you have an accident.</li></ul>\n"},{"Node":"rootNavigation.learner.rulesOfTheRoad.driving.stopping","ImageName":"","Heading":"<span class=\"contentHeading2\">You may not stop:</span>","Description":""},{"Node":"rootNavigation.learner.rulesOfTheRoad.driving.stopping","ImageName":"","Heading":"Where forbidden by","Description":"<ul><li>A traffic officer.</li>\n<li>A road marking.</li>\n<li>A road sign.</li></ul>\n"},{"Node":"rootNavigation.learner.rulesOfTheRoad.driving.stopping","ImageName":"","Heading":"On","Description":"<ul><li>A freeway (except in a designated stopping area).</li>\n<li>A level crossing or railway.</li>\n<li>The right hand side of the road facing on-coming traffic (you may stop on the right of a one-way road).</li>\n<li>The pavement (not even with part of your car).</li>\n<li>At a place where you would cause a danger or obstruction.</li></ul>\n"},{"Node":"rootNavigation.learner.rulesOfTheRoad.driving.stopping","ImageName":"","Heading":"Next to or opposite","Description":"<ul><li>Roadworks or an excavation or other obstruction, if other traffic would be endangered or obstructed.</li>\n<li>A driveway or gate.</li>\n<li>Another vehicle if the road is narrower than 9m.</li></ul>\n"},{"Node":"rootNavigation.learner.rulesOfTheRoad.driving.stopping","ImageName":"","Heading":"Within 6m of","Description":"<ul><li>A tunnel.</li>\n<li>A bridge (on or under).</li>\n<li>A subway.</li>\n<li>A road that has been narrowed for any reason from its normal width.</li></ul>\n"},{"Node":"rootNavigation.learner.rulesOfTheRoad.driving.stopping","ImageName":"","Heading":"Within 9m of","Description":"<ul><li>Your approach side of a pedestrian crossing.</li></ul>"},{"Node":"rootNavigation.learner.rulesOfTheRoad.driving.stopping","ImageName":"","Heading":"Exceptions","Description":"The above rules don&#39;t apply:\n<ul><li>If you need to stop to avoid an accident or for circumstances beyond your control.</li>\n<li>To emergency/construction/police vehicles on duty displaying the correct identification lights.</li></ul>\n"},{"Node":"rootNavigation.learner.rulesOfTheRoad.driving.parking","ImageName":"","Heading":"","Description":"<ul><li>Parking is stopping for longer than is needed to offload passengers or goods.</li>\n<li>Whenever you park you have to use your parking brake/handbrake.</li></ul>\n"},{"Node":"rootNavigation.learner.rulesOfTheRoad.driving.parking","ImageName":"","Heading":"<span class=\"contentHeading2\">You may not park:</span>","Description":"<ul><li>In any no stopping area. These areas have been repeated for you below in red. You may not park or stop in these areas.</li>\n<li>Black text shows items that only apply to parking. You may not park in these areas, but you may stop there.</li></ul>\n"},{"Node":"rootNavigation.learner.rulesOfTheRoad.driving.parking","ImageName":"","Heading":"Where forbidden to park or stop by","Description":"<ul><li style=\"color:red\">A traffic officer.</li>\n<li style=\"color:red\" >A road marking.</li>\n<li style=\"color:red\" >A road sign.</li></ul>\n"},{"Node":"rootNavigation.learner.rulesOfTheRoad.driving.parking","ImageName":"","Heading":"On","Description":"<ul><li style=\"color:red\" >A freeway (except in a designated stopping area).</li>\n<li style=\"color:red\" >A level crossing or railway.</li>\n<li style=\"color:red\" >The right hand side of the road facing on-coming traffic (you may stop on the right of a one-way road).</li>\n<li style=\"color:red\" >The pavement (not even with part of your car).</li>\n<li style=\"color:red\" >A place where you would cause a danger or obstruction.</li>\n<li>A traffic island.</li>\n<li>A pedestrian mall or lane.</li>\n<li>The activating mechanism of a robot.</li>\n<li>The road or within 1m of the road edge outside an urban area.</li></ul>\n"},{"Node":"rootNavigation.learner.rulesOfTheRoad.driving.parking","ImageName":"","Heading":"Where","Description":"<ul><li>The outside of the wheel closest to the kerb is more than 450mm from the kerb (unless you are within a marked parking area).</li>\n<li>You could obscure a road sign.</li>\n<li>The road is less than 5.5m wide (except in one-way streets).</li></ul>\n"},{"Node":"rootNavigation.learner.rulesOfTheRoad.driving.parking","ImageName":"","Heading":"Next to or opposite","Description":"<ul><li style=\"color:red\" >Roadworks or an excavation or other obstruction, if other traffic would be endangered or obstructed.</li>\n<li style=\"color:red\" >A driveway or gate.</li>\n<li style=\"color:red\" >Another vehicle if the road is narrower than 9m.</li></ul>\n"},{"Node":"rootNavigation.learner.rulesOfTheRoad.driving.parking","ImageName":"","Heading":"Within 1.5m of","Description":"<ul><li>A fire hydrant.</li></ul>"},{"Node":"rootNavigation.learner.rulesOfTheRoad.driving.parking","ImageName":"","Heading":"Within 5m of","Description":"<ul><li>An intersection.</li></ul>"},{"Node":"rootNavigation.learner.rulesOfTheRoad.driving.parking","ImageName":"","Heading":"Within 6m of","Description":"<ul><li style=\"color:red\" >A tunnel.</li>\n<li style=\"color:red\" >A bridge (on or under).</li>\n<li style=\"color:red\" >A subway.</li>\n<li style=\"color:red\" >A road that has been narrowed for any reason from its normal width.</li></ul>"},{"Node":"rootNavigation.learner.rulesOfTheRoad.driving.parking","ImageName":"","Heading":"Within 9m of","Description":"<ul><li style=\"color:red\" >Your approach side of a pedestrian crossing.</li></ul>"},{"Node":"rootNavigation.learner.rulesOfTheRoad.driving.parking","ImageName":"","Heading":"Exceptions","Description":"<ul><li>The above rules don&#39;t apply to emergency/construction/police vehicles on duty displaying the correct identification lights.</li></ul>"},{"Node":"rootNavigation.learner.rulesOfTheRoad.driving.dividedRoads","ImageName":"","Heading":"","Description":"<ul><li>These are roads that have been divided into more than one area by a line or barrier.</li>\n<li>Keep to the left of a divided road (unless it is a one way).</li>\n<li>Cross the divider only at an opening or intersection, or where a road marking or police officer says you can.</li></ul>"},{"Node":"rootNavigation.learner.rulesOfTheRoad.driving.changingLanes","ImageName":"","Heading":"","Description":"<ul><li>Keep within your lane. Don&#39;t straddle lanes (when your vehicle is in more than one lane).</li>\n<li>Change lanes only if road markings or signs allow you to.</li>\n<li>Signal early when intending to change lanes.</li>\n<li>Change lanes only if it is safe.</li>\n<li>The last thing you must do before changing lanes is to check your blind spots.</li>\n<li>If changing more than one lane, recheck your blind spots for each lane.</li></ul>"},{"Node":"rootNavigation.learner.rulesOfTheRoad.driving.intersections","ImageName":"","Heading":"Stop streets and traffic lights","Description":"<ul><li>Stop completely before the line at stop streets and red traffic lights.</li>\n<li>Instructions from a traffic officer always take precedence over road signs, signals (including traffic lights) and markings.</li>\n<li>At 3-way or 4-way stops, cars must go in the order in which they arrived. Let anyone who was already at the intersection when you arrived go before you go.</li>\n<li>Flashing red traffic lights act as four-way stops. You must stop completely (not just slow down). First to arrive is first to go. </li></ul>"},{"Node":"rootNavigation.learner.rulesOfTheRoad.driving.intersections","ImageName":"","Heading":"Traffic circles","Description":"<ul><li>Give way to people already in the circle approaching you from the right.</li></ul>"},{"Node":"rootNavigation.learner.rulesOfTheRoad.driving.intersections","ImageName":"","Heading":"Pedestrian crossings","Description":"<ul><li>Stop for people on or approaching your side of a pedestrian crossing.</li></ul>"},{"Node":"rootNavigation.learner.rulesOfTheRoad.driving.intersections","ImageName":"","Heading":"Turning left at an intersection","Description":"<ul><li>Signal about 5 seconds before you get to the point where you want to turn.</li>\n<li>Keep as far to the left as possible before turning.</li>\n<li>Once you have turned, adjust your speed to merge into the traffic flow.</li>\n<li>Cancel your signal after turning.</li></ul>"},{"Node":"rootNavigation.learner.rulesOfTheRoad.driving.intersections","ImageName":"","Heading":"Turning right at an intersection","Description":"<ul><li>Signal about 5 seconds before you get to the point where you want to turn.</li>\n<li>Keep as far to the right as possible before turning (without crossing the dividing line into oncoming traffic).</li>\n<li>Give way to approaching traffic.</li>\n<li>Cross the centre line of the road you&#39;re turning into before you turn (unless it is a one way).</li>\n<li>If there is a traffic island or traffic officer at the intersection, go to the left of them.</li>\n<li>Once you have turned, adjust your speed to merge into the traffic flow.</li>\n<li>Cancel your signal after turning.</li></ul>"},{"Node":"rootNavigation.learner.rulesOfTheRoad.driving.intersections","ImageName":"","Heading":"When not to enter an intersection ","Description":"<ul><li>If your vehicle will block traffic flow.</li>\n<li>Don&#39;t cross or turn into roads unless there is enough clear space on the other side to get completely across without endangering or obstructing traffic.</li>\n<li>Don&#39;t cross over box junctions unless you have enough space on the other side to get completely clear of the junction before stopping.</li></ul>"},{"Node":"rootNavigation.learner.rulesOfTheRoad.driving.signalling","ImageName":"","Heading":"Signal lights","Description":"<ul><li>Use signal lights before you:\n<ul><li>Stop (brake lights)</li>\n<li>Slow suddenly (brake lights)</li>\n<li>Turn (indicators)</li>\n<li>Change lanes (indicators)</li>\n<li>Move to the left or right in the road (indicators).</li></ul></li>\n<li>Signal in good time (about 5 seconds before in the case of indicators).</li><li>Increase this time on freeways or when you are travelling at high speed.</li>\n<li>Make sure your signals can be clearly seen.</li>\n<li>Make sure your signals are cancelled after the manoeuvre.</li></ul>"},{"Node":"rootNavigation.learner.rulesOfTheRoad.driving.signalling","ImageName":"","Heading":"Hand signals","Description":"<ul><li>Use hand signals if your signal lights aren&#39;t working.</li>\n<li>The following hand signals are used:\n<ul><li>Stop/sudden slow down: put your right arm straight out from the shoulder, then bend it up at the elbow, your palm facing forward.</li>\n<li>Slow down: put your right arm straight out from the shoulder, palm facing forward, then move your arm up and down from the shoulder.</li>\n<li>Left turn: put your right arm straight out from the shoulder, then bend it down at the elbow, and move your hand in anti-clockwise circles (cyclists and drivers of tractors and animal drawn vehicles can put their left arms straight out from the shoulder).</li>\n<li>Right turn: put your right arm straight out from the shoulder, palm facing forward. </li>\n<li>Overtake (you&#39;re signaling someone else to overtake you): put your right arm straight out from the shoulder, palm facing forward, then move your arm backwards and forwards from the shoulder.</li></ul></li>\n<li>Signal in good time (about 5 seconds before you do the action you are signaling).</li>\n<li>Make sure your signals can be clearly seen from the front, back and sides.</li>\n<li>If you are towing, use hand signals to signal direction, because your indicators are being used as emergency warning signals. </li>\n<li>If your signal lights aren&#39;t working, don&#39;t go on a freeway. No hand signals are allowed except in an emergency.</li></ul>"},{"Node":"rootNavigation.learner.rulesOfTheRoad.driving.signalling","ImageName":"","Heading":"Emergency stop","Description":"<ul><li>If you have to do an emergency stop don&#39;t signal. Keep both hands on the wheel.</li></ul>"},{"Node":"rootNavigation.learner.rulesOfTheRoad.driving.overtaking","ImageName":"","Heading":"General","Description":"<ul><li>The general rule of the road is keep left, pass right.</li>\n<li>When overtaking, keep a clear space around your vehicle and the one you are passing (don&#39;t cut in).</li>\n<li>If overtaking a stationary object or vehicle (for example a bus), watch out for people who might walk out in front of it.</li>\n<li>Signal your intention to overtake.</li>\n<li>While preparing to overtake, don&#39;t encroach on the right of the road so that it is not safe for oncoming traffic.</li></ul>"},{"Node":"rootNavigation.learner.rulesOfTheRoad.driving.overtaking","ImageName":"","Heading":"You may not overtake when","Description":"<ul><li>Forbidden to by no overtaking signs or road markings (solid lines).</li>\n<li>At a pedestrian crossing.</li>\n<li>Unless you can do it without going onto the right hand side of the road (in other words if the road is wide enough) or if it&#39;s a one way, you may not overtake when:\n<ul><li>You can&#39;t see the road ahead or oncoming traffic.</li>\n<li>Near the summit of a rise (coming up to the top of a hill).</li>\n<li>On a blind curve or corner.</li></ul></li></ul>"},{"Node":"rootNavigation.learner.rulesOfTheRoad.driving.overtaking","ImageName":"","Heading":"Overtaking on the left","Description":"<ul><li>You can never drive on the road shoulder or verge or to the left of the edge line to overtake.</li>\n<li>As long as you don&#39;t do this, you may overtake on the left:\n<ul><li>When the driver in front of you is turning right</li>\n<li>If the road is a one-way and wide enough for two cars (in an urban area)</li>\n<li>If the lane you are in is wide enough for two cars (in an urban area)</li>\n<li>If there is more than one lane going in your direction</li>\n<li>If traffic officer tells you to.</li></ul></li></ul>"},{"Node":"rootNavigation.learner.rulesOfTheRoad.driving.overtaking","ImageName":"","Heading":"Being overtaken","Description":"<ul><li>Keep as far to the left as is safe.</li>\n<li>Maintain a constant speed. Do not speed up.</li>\n<li>You may move onto the road shoulder if you are being overtaken under certain circumstances (see below).</li></ul>"},{"Node":"rootNavigation.learner.rulesOfTheRoad.driving.overtaking","ImageName":"","Heading":"Road shoulders","Description":"<ul><li>The road shoulder is the section inside the yellow line on the left of the road.</li>\n<li>The only time you can drive on it is when:\n<ul><li>You are going onto the road shoulder to let someone pass, and</li>\n<li>There is only one lane going in each direction, and</li>\n<li>It is safe to do so, and</li>\n<li>You can see ahead for at least 150m, and</li>\n<li>It is day time (between sunrise and sunset).</li></ul></li></ul>"},{"Node":"rootNavigation.learner.rulesOfTheRoad.driving.overtaking","ImageName":"","Heading":"Freeways","Description":"<ul><li>If you&#39;re in the &#34;fast&#34; lane (furthest right lane going in your direction) on a freeway and you want to overtake someone in front of you, you can flash your headlights at them.</li>\n<li>If you&#39;re in the fast lane and someone flashes you to show they want to overtake, move to the left as soon as it is safe to do so.</li></ul>"},{"Node":"rootNavigation.learner.rulesOfTheRoad.driving.towing","ImageName":"","Heading":"General rules","Description":"<ul><li>The two vehicles must be closer than 3.5m to each other.</li>\n<li>They should be securely attached.</li>\n<li>Both vehicles must be under control.</li>\n<li>Motorcycles, tricycles, quadrucycles and pedal cycles can&#39;t tow vehicles.</li></ul>"},{"Node":"rootNavigation.learner.rulesOfTheRoad.driving.towing","ImageName":"","Heading":"When towing with a rope","Description":"<ul><li>If the rope is over 1.8m long it must be marked with a red flag.</li>\n<li>The towed vehicle must have a driver with a driver&#39;s licence for that class of vehicle in it (no driver is needed if there is a solid tow bar or the front wheels are clear of the ground).</li>\n<li>There can be no passengers in the towed vehicle, unless it is a tractor towing a semi-trailer (and they are not being charged).</li>\n<li>You may not go over 30km/h.</li>\n<li>Don&#39;t use a rope to tow if the towed vehicle has weak brakes.</li></ul>"},{"Node":"rootNavigation.learner.rulesOfTheRoad.driving.towing","ImageName":"","Heading":"When towing with a solid tow bar","Description":"<ul><li>You may go over 30km/h if there are no passengers (only semi-trailers may be towed at over 30km/h carrying passengers).</li>\n<li>The towed vehicle does not need a driver.</li>\n<li>You must use a solid tow bar for towing vehicles with weak brakes.</li></ul>"},{"Node":"rootNavigation.learner.defensiveDriving.introToK53","ImageName":"","Heading":"","Description":"<ul><li>In the 1980&#39;s the South African government looked at proposals for a new system of testing driver&#39;s licences. Each proposal got a new number, and test number 53 was the one that was finally accepted.</li>\n<li>It is similar to the UK tests of the 1980&#39;s.</li>\n<li>The main aims of the K53 test are to encourage defensive driving: at all times protecting yourself against losing control of your vehicle and from possible collisions.</li></ul>"},{"Node":"rootNavigation.learner.defensiveDriving.introToK53","ImageName":"","Heading":"Principles of defensive driving","Description":"To drive defensively you need to:\n<ul><li>Know how to use your vehicle controls.</li>\n<li>Be on the lookout all the time, by observing. This means looking around your car, including in your mirrors and your blind spots.</li>\n<li>Be able to recognize hazards (dangers).</li>\n<li>Know how to deal with hazards.</li>\n<li>Give yourself enough time to react to hazards, by keeping a good following distance and keeping safe clear space all around your vehicle all the time.</li>\n<li>Know the basic K53 procedure: the 10 steps used for most driving procedures (eg turning, overtaking, etc).</li></ul>\n"},{"Node":"rootNavigation.learner.defensiveDriving.typesOfHazards","ImageName":"","Heading":"","Description":"A hazard (or danger) is any object or action that could make you change your speed or direction while driving. There are three kinds:"},{"Node":"rootNavigation.learner.defensiveDriving.typesOfHazards","ImageName":"","Heading":"Stationary hazards","Description":"<ul><li>Stationary hazards don&#39;t move.</li>\n<li>They are mostly to do with the road, and include:\n<ul><li>Corners</li>\n<li>Sharp bends</li>\n<li>Intersections</li>\n<li>Road junctions</li>\n<li>Potholes</li>\n<li>Uneven roads</li>\n<li>Lampposts</li>\n<li>Trees</li>\n<li>Driveways</li>\n<li>Parked cars</li></ul></li>\n<li>They are dangerous because: \n<ul><li>They make it hard to see ahead </li>\n<li>Things can come out of them or round them</li>\n<li>You could crash into them.</li></ul></li></ul>\n"},{"Node":"rootNavigation.learner.defensiveDriving.typesOfHazards","ImageName":"","Heading":"Moving hazards","Description":"<ul><li>Moving hazards include anything moving in the road, or anything that could go into the road.</li>\n<li>They could be next to the road and then run into it (animals and children on the side of the road are dangerous because they&#39;re unpredictable).</li>\n<li>Moving hazards have to do with other road users, and include:\n<ul><li>Vehicles (including those going in the same direction as you)</li>\n<li>Pedestrians</li>\n<li>Bicycles</li>\n<li>Animals</li>\n<li>Bright headlights</li></ul></li>\n<li>They are dangerous because: \n<ul><li>You could crash into them.</li>\n<li>They could cause you to swerve or lose control.</li></ul></li></ul>\n"},{"Node":"rootNavigation.learner.defensiveDriving.typesOfHazards","ImageName":"","Heading":"Changing hazards","Description":"<ul><li>Changing hazards mostly have to do with weather conditions, and include:\n<ul><li>Wind</li>\n<li>Dust</li>\n<li>Rain</li>\n<li>Mist/fog</li>\n<li>Snow/ice</li>\n<li>Sun (especially the setting/rising sun)</li></ul></li>\n<li>They are dangerous because: \n<ul><li>They make it hard to see ahead</li>\n<li>They could cause your vehicle to move or slip on the road.</li></ul></li></ul>\n"},{"Node":"rootNavigation.learner.defensiveDriving.dealingWithHazards","ImageName":"","Heading":"","Description":"There are five steps involved in dealing with hazards:\n<ul><li>Search</li>\n<li>Identify</li>\n<li>Predict</li>\n<li>Decide</li>\n<li>Act</li></ul>\n"},{"Node":"rootNavigation.learner.defensiveDriving.dealingWithHazards","ImageName":"","Heading":"Search","Description":"<ul><li>As you drive, look out for hazards all the time.</li>\n<li>You should be observing (checking mirrors) every 5-8 seconds.</li>\n<li>Hazards can come from any direction, including from off the road. Look on the sides and look out for what could come out from driveways, from behind buses, etc.</li></ul>\n"},{"Node":"rootNavigation.learner.defensiveDriving.dealingWithHazards","ImageName":"","Heading":"Identify","Description":"<ul><li>As soon as you see something, ask yourself if it is a hazard, and what type.</li></ul>"},{"Node":"rootNavigation.learner.defensiveDriving.dealingWithHazards","ImageName":"","Heading":"Predict","Description":"<ul><li>For each hazard you see, ask yourself what the worst thing is that could happen.\n<ul><li>If you are passing a driveway, could a car come out of it?</li>\n<li>If there is a child or animal on the side of the road, could they run into it?</li>\n<li>If you are approaching a green robot, will it change?</li>\n<li>If there is a car on the side of the road in front of you, will they pull out in front of you or open their door?</li>\n<li>If the roads are wet and you need to brake suddenly, could your car slip?</li></ul></li>\n<li>What will the outcome of any action you take be? </li></ul>\n"},{"Node":"rootNavigation.learner.defensiveDriving.dealingWithHazards","ImageName":"","Heading":"Decide","Description":"<ul><li>If your prediction happens, what will you do?</li>\n<li>Decide on an action that is safe and appropriate.</li>\n<li>Check how much space do you have: where are there other cars? If you need to swerve, will you go left or right?</li>\n<li>Appropriate actions can include:\n<ul><li>Dropping your speed</li>\n<li>Hooting to alert other road users</li>\n<li>Swerving</li>\n<li>Braking</li></ul></li></ul>\n"},{"Node":"rootNavigation.learner.defensiveDriving.dealingWithHazards","ImageName":"","Heading":"Act","Description":"<ul><li>Carry out the action your have decided on.</li></ul>"},{"Node":"rootNavigation.learner.defensiveDriving.clearSpace","ImageName":"","Heading":"Clear space","Description":"<ul><li>Keeping clear space around your vehicle at all times means that you are keeping further away from potential hazards, and giving yourself space to manoeuvre in and react.</li>\n<li>When overtaking, changing lanes or pulling into the road, don&#39;t cut in on people. Move in far enough behind or in front of other cars.</li></ul>\n"},{"Node":"rootNavigation.learner.defensiveDriving.clearSpace","ImageName":"","Heading":"Following a car","Description":"<ul><li>When you are following another vehicle, leave a 2 second following distance.</li>\n<li>To work out your following distance, let the car in front of you pass something stationary, like a lamppost or sign on the side of the road, and as it passes count &#34;One second, two seconds&#34; slowly. Your car should pass the marker when you finish saying &#34;two seconds&#34;.</li>\n<li>At different speeds the actual distance differs: when you are going fast, a two second following distance means you are much further behind the other car. When you are going slowly the following distance is still two seconds, but you are much closer to the other car.</li>\n<li>The following distance is there to give yourself time to react. If the car in front of you brakes suddenly, there is a slight delay as your brain see this, decides to brake, and your foot actually hits the brake and the car comes to a stop. </li>\n<li>If your vehicle is carrying a heavy load, or if there are a lot of people in it, it takes longer to stop. Increase your following distance.</li>\n<li>In bad conditions (for example at night, when it is raining or misty), leave a 4 second following distance.</li>\n<li>Heavy vehicles should leave a 3 second gap in normal conditions, more for bad conditions.</li></ul>\n"},{"Node":"rootNavigation.learner.defensiveDriving.clearSpace","ImageName":"","Heading":"Cars following you","Description":"<ul><li>If someone is following you too closely, open the following distance ahead of you (don&#39;t try to speed up). </li>\n<li>This gives you more room to manoeuvre, and might encourage them to overtake you which will get them out of your way.</li></ul>\n"},{"Node":"rootNavigation.learner.defensiveDriving.clearSpace","ImageName":"","Heading":"Stopping behind a stationary car","Description":"<ul><li>When you stop behind a stationary car (for example at a stop street) you should be able to see its back wheels. If you can&#39;t, you&#39;re too close.</li><li>A good guideline is 4-5m behind.</li>\n<li>You should be able to drive out from behind them without reversing.</li>\n<li>If you&#39;re too close, then if someone hits you from the back you may be pushed into the car in front of you. </li>\n<li>If you&#39;re too close, they could roll back onto you as they move off.</li></ul>\n"},{"Node":"rootNavigation.learner.defensiveDriving.clearSpace","ImageName":"","Heading":"Stopping distances","Description":"<ul><li>When you hit the brakes, the car doesn&#39;t stop immediately. </li>\n<li>The faster you are going, and the heavier your car, the longer it takes to stop.</li>\n<li>At 65km/h the risk of crashing is double the risk at 60km/h.</li>\n<li>At 60km/h it will take you 45m to stop.</li>\n<li>If you were going 65km/h then by the 45m mark you would still be going 32km/h.</li>\n<li>Pace out 45m on a roadway. Think about the fact that if a child ran out into the road in front of your car just before that mark you would not be able to stop in time, even if you were only doing 60 km/h.</li>\n<li>At 100km/h your stopping distance is 100m.</li>\n<li>At 120km/h your stopping distance is 130m.</li></ul>\n"},{"Node":"rootNavigation.learner.defensiveDriving.observing","ImageName":"","Heading":"General observation","Description":"<ul><li>In general, be looking to the road ahead all the time when you are driving. When you do look away, for example to check your mirrors, do it quickly and then look ahead again.</li>\n<li>Check all three of your mirrors every 5-8 seconds. In your test you will be penalised if you do not do this.</li>\n<li>Also check your vehicle gauges occasionally: check your speed and for any warning lights.</li>\n<li>Check your blind spots whenever you are moving to a different side of the road, for example when pulling off from the side, changing lanes or turning.</li></ul>\n"},{"Node":"rootNavigation.learner.defensiveDriving.observing","ImageName":"","Heading":"Blind spots","Description":"<ul><li>These are areas around your car that you can&#39;t see in your rear-view mirrors.</li>\n<li>You might check your mirrors, see no cars and turn... and hit a car that was in your blind spot.</li>\n<li>To check your right blind spot, turn your head to the right and look over your shoulder through the drivers and back passenger windows.</li>\n<li>To check your left blind spot, turn your head to the left and look over your shoulder through the front and back passenger windows. </li>\n<li>Checking your blind spot must always be the last thing you do before turning or changing lanes. </li>\n<li>Also check your blind spot before opening your doors.</li></ul>\n"},{"Node":"rootNavigation.learner.defensiveDriving.observing","ImageName":"","Heading":"Finding out where your blind spots are","Description":"<ul><li>Sit in a parked car (in the driver&#39;s seat).</li>\n<li>Get someone to walk towards the car from the back. They should walk in a line 2m away from the driver&#39;s side of the car.</li>\n<li>Watch them in your driver&#39;s side mirror.</li>\n<li>When they disappear, they&#39;re in the blind spot. Tell them to stop.</li>\n<li>Turn your head and see how far back you have to look to see them.</li>\n<li>Imagine a mark on the inside of your car that tells you where you have to look to.</li>\n<li>Repeat this on the passenger&#39;s side.</li></ul>\n"},{"Node":"rootNavigation.learner.defensiveDriving.generalK53Procedure","ImageName":"","Heading":"","Description":"There are 10 steps that make up all the K53 procedures. In each situation you may use all or some of these steps. In the Driver&#39;s section of Learn2Drive3D each procedure is set out in detail, but we&#39;ve listed the main steps here for you, and broken them into three main groups."},{"Node":"rootNavigation.learner.defensiveDriving.generalK53Procedure","ImageName":"","Heading":"If you have to signal","Description":"1. Observe (ahead and all mirrors, to check the general traffic situation)<br/>\n2. Blind spot (to check the general traffic situation)<br/>\n3. Signal (remember signals are indicators, brake lights, hooter or hand signals)\n"},{"Node":"rootNavigation.learner.defensiveDriving.generalK53Procedure","ImageName":"","Heading":"If you have to slow down/brake","Description":"4. Mirrors (all mirrors, to see if it is safe to slow down)<br/>\n5. Brake<br/>\n6. Gear (change gear if necessary)\n"},{"Node":"rootNavigation.learner.defensiveDriving.generalK53Procedure","ImageName":"","Heading":"If you have to change direction","Description":"7. Blind spot (in the direction in which you are turning, to make sure it is safe. This is always the last thing you do before manoeuvering.)<br/>\n8. Steer<br/>\n9. Accelerate<br/>\n10. Cancel signal\n"},{"Node":"rootNavigation.learner.introduction","ImageName":"","Heading":"Welcome to the Learner&#39;s section of Learn2Drive3D","Description":"The Learner&#39;s section of Learn2Drive3D contains everything you need to know to pass your Learner&#39;s Licence test. It covers the same ground as the traffic department&#39;s Learner licence test:\n<ul><li>Vehicle controls</li>\n<li>Rules of the road</li>\n<li>Defensive driving</li>\n<li>Road signals</li>\n<li>Road signs</li>\n<li>Road markings</li></ul>"},{"Node":"rootNavigation.learner.introduction","ImageName":"RulesOfTheRoad/learners_navigator.png","Heading":"Navigating around the Learner&#39;s section","Description":"<ul><li>Use the Navigator on the left to move around from page to page, and remember the back button and the breadcrumb at the top of the screen.</li>\n<li>Close the Navigator with the double white arrows if you need more space to work, and open it again when you need it to move to another section. Try this now to give yourself more space to read these notes.</li></ul>"},{"Node":"rootNavigation.learner.introduction","ImageName":"RulesOfTheRoad/learner_modes.png","Heading":"The Learn2Drive3D Modes","Description":"<ul><li>There are three different modes in the Learner&#39;s section. The blue buttons for switching modes are at the top right of the screen, and you&#39;ll always be told which mode you&#39;re working in.</li>\n<li><b>Learn mode</b> is where you will study the content. Read through each page till you understand the concepts.</li>\n<li>Most of the sections have quizzes attached to them. Click on the <b>Quiz mode</b> button to get to the quiz for the section you&#39;re in. In the Vehicle Controls quiz you&#39;ll click on the various controls you&#39;re asked to identify. Once you&#39;ve studied the road signals, signs, and markings, the quizzes for these sections will hide the names of the symbols and what they mean away. Try to remember the meaning of each symbol and move your mouse over it to check if you are right. Note that Rules of the Road and Defensive driving do not have quizzes.</li>\n<li>Once you think you have mastered the content of a section, click to <b>Test mode</b>. This will give you a selection of multiple choice questions relating to the section you are on. Answer the questions and click the mark button to view your score and the correct answers.</li></ul>"},{"Node":"rootNavigation.learner.introduction","ImageName":"RulesOfTheRoad/learners_logbook.png","Heading":"Tracking your progress","Description":"<ul><li>Remember that your scores are being recorded in the <b>Logbook</b>, where you can view old tests and see which sections you still need to study or test yourself on.</li> \n<li>The Logbook is in the Home section.</li></ul>"},{"Node":"rootNavigation.learner.introduction","ImageName":"","Heading":"More about the tests","Description":"<ul><li>Each menu item in the Navigator, or each section of the Learner&#39;s content, has questions attached to it.</li>\n<li>For example, in the Rules of the Road > Driving > Speed limits section, you will only get questions about Speed limits.</li>\n<li>After doing this test you would move on to study the next section on Rules of the Road > Driving > Stopping, and then do its test.</li>\n<li>If you move up a level onto the Driving section, you&#39;ll get a test combining questions on Speed limits and Stopping, as well as the other sub-sections under Driving, so as you finish each major section you can revise previous work.</li>\n<li>One level up on the Rules of the Road level you will get a selection of questions from all its sub-sections (The driver, The car, The road and Driving).</li><li>Note that you will only have questions included from sections that are activated. Questions from locked sections will be hidden.</li></ul>"},{"Node":"rootNavigation.learner.introduction","ImageName":"RulesOfTheRoad/learners_mocktest.png","Heading":"The Mock Test","Description":"<ul><li>Once you&#39;ve studied all the sections, do a <b>Mock test</b>. This works in the same way as the Learner&#39;s Licence test you&#39;ll write at the traffic department. There are three sections:\n<ul><li>Vehicle controls</li>\n<li>Rules of the road, defensive driving and road signals</li>\n<li>Road signs and road markings</li></ul></li>\n<li>Each section is marked separately and you need to pass all three to get an overall pass. Learn2Drive3D will give you the individual section results, as well as the overall result. </li>\n<li>Practise the test as many times as you like. You&#39;ll get a new spread of questions each time.</li><li>The test is tough, so don&#39;t be discouraged if your results are bad at first. Better to have a few retries here in Learn2Drive3D than at the traffic department. If you are doing really badly, revise each section in Learn Mode and do the individual section tests until you feel ready to attempt the mock test again.</li>\n<li>If you can pass this test at least three times you&#39;re in great shape for your traffic department test.</li></ul>"},{"Node":"rootNavigation.learner.introduction","ImageName":"RulesOfTheRoad/learner_checklist.png","Heading":"Other resources","Description":"The <b>Checklist</b> helps you keep track of all the tasks you&#39;ll need to do before you write your test, like booking a test date and getting photos. It explains exactly what you need to take with you and where you can book. The checklist is in the Home section."},{"Node":"rootNavigation.driver.introduction.howToUseDriversSection","ImageName":"","Heading":"How to use the driver&#39;s section of Learn2Drive3D","Description":"The driver&#39;s section is the really exciting part of Learn2Drive3D. Here you&#39;ll be taken through all the driving procedures you&#39;ll need to perform during your Driver&#39;s licence test. The modules are based on the latest official K53 syllabus from the Department of Transport. "},{"Node":"rootNavigation.driver.introduction.howToUseDriversSection","ImageName":"","Heading":"Organisation of the Modules","Description":"As they do at the traffic department, we&#39;ve divided the modules into the Pre-trip inspection, the Yard test and the Road test. There are also &#34;In car&#34; scenarios which explain things like steering and gear changing which you&#39;ll do continuously throughout both the yard and the road tests. Use the Navigator on the left to navigate to each module."},{"Node":"rootNavigation.driver.introduction.howToUseDriversSection","ImageName":"RulesOfTheRoad/drivers_overview.png","Heading":"Module Overviews","Description":"Each module has an <b>overview</b> page. This gives you some background to the module, and lets you know whether it is a required module for the test or not. You&#39;ll see exactly how the module is scored in the official test report sheet, and what you can do to make sure you don&#39;t lose points or fail automatically. The steps and the order you need to do them in are listed, as well as any notes. These steps and notes are taken straight from the traffic department notes. They&#39;re written as instructions to the examiners on how to examine the test, so it&#39;s as if you&#39;re getting inside info."},{"Node":"rootNavigation.driver.introduction.howToUseDriversSection","ImageName":"RulesOfTheRoad/drivers_switching.png","Heading":"Switching between the Overview and the Simulator","Description":"<ul><li>While you&#39;re working through the overview page, the 3D simulator module will be loading in the background. Go to it by clicking the <b>start button</b> at the bottom of the overview page.</li>\n<li>There are also <b>green icons</b> at the top of your screen to let you switch between the overview page and the simulator at any time.</li></ul>"},{"Node":"rootNavigation.driver.introduction.howToUseDriversSection","ImageName":"","Heading":"The Simulator","Description":"In the simulator, the module will start playing immediately. Watch it once all the way through. There is a lot to look at! When we see a new module for the first time we sometimes go &#34;What just happened?&#34; Don&#39;t worry, you&#39;ll be watching the modules over and over again as you study them. "},{"Node":"rootNavigation.driver.introduction.howToUseDriversSection","ImageName":"RulesOfTheRoad/drivers_simulator_anatomy.png","Heading":"Anatomy of the simulator","Description":"<ul><li>Along the right hand side the steps for the scenario are listed as <b>keywords</b>. Each step&#39;s keyword will be highlighted as it is playing.</li>\n<li>A longer <b>description</b> of the step is listed at the top of the screen. There are also <b>additional comments</b> which you can view by opening the comment box (use the little black arrow). Close it again with the same arrow if you want more space on your screen.</li>\n<li>Each step is illustrated with actions in the <b>main window</b>.</li>\n<li>The relevant actions are also highlighted on the <b>dashboard</b> at the bottom of the screen.</li></ul>"},{"Node":"rootNavigation.driver.introduction.howToUseDriversSection","ImageName":"","Heading":"Playing steps or modules","Description":"<ul><li>Don&#39;t try to watch everything at once. I suggest that the first time you watch a module you focus on the main screen to get an overview of what is happening. </li><li>Then work through each step, one at a time. </li><li>If you <b>click once</b> on a step you will move to that step, but the step will be paused on the first frame and won&#39;t play yet. This will give you time to read through all the comments. </li><li>If you <b>double-click</b> on a step it will play the action for just that step.</li><li>You can play the scenario right through from any particular step (including the first one) by going to that step and clicking the <b>play button</b> at the top of the screen. </li><li><b>Pause</b> it if you need to.</li></ul>"},{"Node":"rootNavigation.driver.introduction.howToUseDriversSection","ImageName":"","Heading":"What to focus on","Description":"<ul><li>For complicated scenarios you might want to focus on just some of the actions at a time. For example in the gear changing scenario you might watch the hands the first time, and then see what the feet are up to on the replay.</li> \n<li>In the road test scenarios you are seeing the action from outside the car but a dashboard is also provided so that you can follow the steps on the vehicle controls. Focus on the main action the first time you watch and then check which vehicle controls are involved on the replay.</li></ul>"},{"Node":"rootNavigation.driver.introduction.howToUseDriversSection","ImageName":"RulesOfTheRoad/drivers_resolution.png","Heading":"Getting more space on your screen","Description":"<ul><li>If you find you don&#39;t have enough space on your screen, for example if you can&#39;t view all the comments, <b>close the navigator</b> using the double white arrows at the top of it. Open it again in the same way if you need it.</li>\n<li>You can also try changing your <b>screen resolution</b>. Right-click on your desktop, and then go to Properties and then Settings. The scenarios look best on 1024 by 768 or higher. Change your screen resolution up to fit more on your screen.</li></ul>"},{"Node":"rootNavigation.driver.introduction.howToUseDriversSection","ImageName":"RulesOfTheRoad/drivers_settings.png","Heading":"Changing your simulator settings","Description":"If you find that the scenarios are playing very slowly your computer might not be that powerful. You can try changing the <b>simulator settings</b> to a lower level of detail or a lower resolution so that it doesn&#39;t need as much power. You get to the settings screen using the green settings icon at the top of the screen."},{"Node":"rootNavigation.driver.introduction.howToUseDriversSection","ImageName":"RulesOfTheRoad/drivers_logbook.png","Heading":"Tracking your progress","Description":"As usual, your progress is being tracked in the <b>Logbook</b>, so check there to see which scenarios you still need to work through. The logbook is in the Home section."},{"Node":"rootNavigation.driver.introduction.howToUseDriversSection","ImageName":"","Heading":"Extra resources","Description":"On the next few pages here in the Introduction section we&#39;ve provided extra information about the official Traffic Department Driving Test.\n<ul><li>There is an <b>overview of the test</b>, to explain the procedure and the requirements for both the Yard and Road tests, and how they are scored..</li>\n<li>Then there are <b>specifications</b> or measurements so that you can set up your own test yard somewhere and practise manoeuvres like parallel parking. These specifications are the ones used for the yard tests at the traffic department, so you can be sure the spaces you&#39;re practising turning and parking in will be the same during the test. If you do set up a mock yard, make sure you do it on your own property or somewhere where there is no traffic, and where you are not breaking any regulations. Also make sure that any poles or markers that you use are not made of metal or material that will damage your car.</li>\n<li>The last resource is the <b>Test Report</b> that is used in the official test. Print it out and get someone to mark you as you do a mock test!</li></ul>"},{"Node":"rootNavigation.driver.introduction.howToUseDriversSection","ImageName":"","Heading":"GOOD LUCK AND BE SAFE!","Description":""},{"Node":"rootNavigation.driver.introduction.overviewOfDrivingTest","ImageName":"","Heading":"Introduction","Description":"The test you will go through to get your driver&#39;s licence is a practical test only. There is no written or theory component.<br/>\nThere are two parts to the test:\n<ul><li>The yard test</li>\n<li>The road test</li></ul>\nThe examiner will be looking to see:\n<ul><li>How well you handle your vehicle</li>\n<li>Whether you obey traffic rules</li>\n<li>How well you cope with traffic problems when you are driving</li></ul>\nTo an extent you can get to know what to expect in your test:\n<ul><li>There are <b>prescribed manoeuvres</b> that are tested in each section of the test. All these modules are covered here in Learn2Drive3D.</li>\n<li>The yards are always laid out following certain <b>specifications</b>. We&#39;ve included these specifications for you here in the following pages of this Intro section.</li>\n<li>The <b>routes followed</b> are pre-established. Ask someone else who has done the test at the same traffic centre as you where they went. Bear in mind that each test centre usually has two or three routes that they use, so you might not get exactly the same one.</li>\n<li>The test is always marked on the same standard <b>test report</b>. We&#39;ve included the test report here for you in the Intro section.</li></ul>"},{"Node":"rootNavigation.driver.introduction.overviewOfDrivingTest","ImageName":"","Heading":"Method","Description":"<ul><li>The yard test must be passed first.</li>\n<li>If you pass the yard test, you will go on to do the road test.</li>\n<li>You have to do both tests on the same day.</li>\n<li>The examiner should do your road test directly after the yard test. He is not allowed to test other candidates in between.</li>\n<li>If you have to stop your test for any reason, when you redo it you will have to redo the full test. For example if you passed your yard test but had to stop during your road test, when you redo the test you will have to redo the yard test as well.</li></ul>"},{"Node":"rootNavigation.driver.introduction.overviewOfDrivingTest","ImageName":"","Heading":"Type of vehicle","Description":"For the light motor vehicle test, you need to do the test in a vehicle\n<ul><li>That is roadworthy</li>\n<li>Where the tare/gross vehicle mass is not more than 3 500 kg</li>\n<li>Where the length is at least 3m</li>\n<li>That is not a combination of vehicles, for example a car and trailer</li>\n<li>That does not have markings on the inside or outside to help you during the practical test.</li></ul>\nUsually you have to supply your own vehicle, but at some Testing Centres (for example in Kwa-Zulu Natal) the vehicle is supplied for you at the Test Centre."},{"Node":"rootNavigation.driver.introduction.overviewOfDrivingTest","ImageName":"","Heading":"Ethics","Description":"Both you and the examiner or other officials may not\n<ul><li>Smoke</li>\n<li>Use a cellphone</li></ul>"},{"Node":"rootNavigation.driver.introduction.overviewOfDrivingTest","ImageName":"","Heading":"Test requirements","Description":"All you need to supply for the test is:\n<ul><li>Yourself</li>\n<li>Your vehicle</li>\n<li>Your learner&#39;s licence</li></ul>\nRemember to have a licensed driver take you to the Test Centre, since you won&#39;t yet be licensed to drive on your own.\n<br/>\nThe examiner needs:\n<ul><li>A test report</li>\n<li>A pen</li>\n<li>A clipboard</li>\n<li>A stopwatch</li></ul>"},{"Node":"rootNavigation.driver.introduction.overviewOfDrivingTest","ImageName":"","Heading":"Requirements for the yard test","Description":"You will do all the following procedures during the yard test:\n<ul><li>Pre-trip inspection: exterior and interior</li>\n<li>Turn in the road</li>\n<li>Alley docking (to the left and to the right)</li>\n<li>Parallel parking (to the left and to the right</li>\n<li>Incline start</li></ul>\nYou will always start with the pre-trip inspections, but the other procedures can all be done in any order (the examiner will advise you which one to do next).\n<br/>\nThe yard test must be done in an area that is closed to other traffic and people.\nThe yard at each traffic department could be laid out slightly differently, but they will all have the following areas:\n<ul><li>Place for incline start</li>\n<li>Place for parallel parking from the left and the right</li>\n<li>Place for alley docking from the left and the right</li></ul>\nThe widths of the roads, sizes of the parking areas, heights of the incline etc all have to follow the same specifications. You can find the specifications in in the next menu item down."},{"Node":"rootNavigation.driver.introduction.overviewOfDrivingTest","ImageName":"","Heading":"Requirements for the road test","Description":"<ul><li>You can only start the road test when you have passed the yard test.</li>\n<li>Each test centre has to have at least two predetermined routes.</li>\n<li>They can use any one of these routes for the test.</li>\n<li>Each test route needs to include at least the following:</li>\n<li>A road with more than one lane in the same direction which has clear road markings and where you can do a lane change. This road should have at least two controlled intersections.</li>\n<li>At least one intersection controlled by four-way stop signs.</li>\n<li>At least four intersections controlled by stop signs or traffic lights. You need to make a right turn at at least two of these, without using a flashing green arrow.</li>\n<li>At least one intersection controlled by a yield sign where you have to yield to other traffic.</li>\n<li>At least one intersection controlled by a yield sign where you have right of way.</li>\n<li>You need to cross two way traffic at at least two intersections, without using a flashing green arrow.</li>\n<li>A quiet road where you can do the emergency stop.</li>\n<li>You can&#39;t cross the same intersection in the test route more than twice from the same direction.</li>\n<li>At least 65% of the test route should be on public roads in an urban area.</li></ul>"},{"Node":"rootNavigation.driver.introduction.overviewOfDrivingTest","ImageName":"","Heading":"Implementation of the test","Description":"<ul><li>The examiner can&#39;t mention or comment on any mistakes that you make during the test.</li>\n<li>The examiner can&#39;t help you with any manoeuvre.</li>\n<li>The examiner can&#39;t ask you any questions to test your theoretical knowledge.</li>\n<li>The examiner will not allow anyone to either help or obstruct you during the test.</li>\n<li>Only the examiner or other officials may be with you in the car during the test.</li>\n<li>Any travelling that needs to be done during the test (for example moving to the area for parallel parking) may only be done after the pre-trip inspections, and you will have to be driving.</li>\n<li>If you fail at any point and the examiner thinks it would not be safe for you to drive back, he will drive back to the Test Centre.</li>\n<li>After the test you will sign the test report, the examiner will discuss it with you and you will be given a copy.</li></ul>"},{"Node":"rootNavigation.driver.introduction.overviewOfDrivingTest","ImageName":"","Heading":"General","Description":"Throughout the test, from the beginning of the yard test to the end of the road test, you will be marked on:\n<ul><li>Violation of traffic law</li>\n<li>Uncontrolled or dangerous action</li>\n<li>Collision or mechanical failure.</li></ul>"},{"Node":"rootNavigation.driver.introduction.overviewOfDrivingTest","ImageName":"","Heading":"Collision","Description":"<ul><li>If you cause a collision or are involved in a collision that could have been avoided, you will fail immediately and the test will end. </li>\n<li>If someone else caused the collision and the examiner thinks you could not have avoided it, you can choose if you want to continue the test (if your vehicle is still roadworthy).</li>\n<li>If your vehicle is no longer roadworthy or you want to defer the test you may.</li></ul>"},{"Node":"rootNavigation.driver.introduction.overviewOfDrivingTest","ImageName":"","Heading":"Mechanical failure","Description":"If your vehicle breaks down and the test can&#39;t be continued it will be deferred."},{"Node":"rootNavigation.driver.introduction.overviewOfDrivingTest","ImageName":"","Heading":"Deferred test","Description":"<ul><li>If a test is deferred, the examiner will write the reason on the test report.</li>\n<li>If the test is deferred then you will have to redo all sections of the test when you redo it.</li></ul>"},{"Node":"rootNavigation.driver.introduction.overviewOfDrivingTest","ImageName":"","Heading":"Timing of the test","Description":"<ul><li>The yard test must be completed in less than 20 minutes. If you take longer than 20 minutes you will fail.</li>\n<li>The road test must be longer than 20 minutes, but less than 45 minutes.</li>\n<li>In the road test, you are allowed to lose a certain number of points per minute, so the longer your test time, the more points you can lose before you fail.</li>\n<li>If your test takes longer than 45 minutes for any reason you will not have any more points deducted after that time (but you can still fail immediately for automatic fail items like violation of traffic law).</li></ul>"},{"Node":"rootNavigation.driver.introduction.overviewOfDrivingTest","ImageName":"","Heading":"Immediate failure","Description":"You will fail immediately at any point for:\n<ul><li>Unroadworthy vehicle</li>\n<li>Violation of traffic law</li>\n<li>Uncontrolled or dangerous action</li>\n<li>Causing a collision or being involved in a collision you could have avoided</li>\n<li>Rolling back during any manoeuvre during the yard or road tests</li></ul>\nYou will fail immediately during the yard test for:\n<ul><li>Alley docking: hitting the obstacles; not getting into the correct position after two attempts.</li>\n<li>Parallel parking: mounting the kerb or hitting the obstacles, or not getting in the parking after more than two attempts.</li>\n<li>Turn in the road: mounting the kerb; more than 3 movements (you only get one attempt).</li></ul>\nYou will fail immediately during the road test for:\n<ul><li>Not doing a satisfactory emergency stop after two attempts.</li></ul>"},{"Node":"rootNavigation.driver.introduction.overviewOfDrivingTest","ImageName":"","Heading":"Scoring of the test","Description":"<ul><li>There are specific errors that the examiner will be watching for. Each one is listed on the test report, with a number to the left of it in brackets. The number represents the number of penalty points each time you make that error.</li>\n<li>For example, if you forget to cancel your signal twice during alley docking, the examiner will make two marks next to the cancel signal item, and later calculate this to be 8 points (2 x 4). The total 8 will be written in the white box to the right of the item.</li>\n<li>All scores for a section are added at the bottom of the section next to the remarks box, and later a total for the yard test, and one for the road test is calculated.</li></ul>"},{"Node":"rootNavigation.driver.introduction.overviewOfDrivingTest","ImageName":"","Heading":"You will fail the yard test if","Description":"<ul><li>You get 50 points.</li>\n<li>For any &#34;black box&#34; item (immediate fail).</li>\n<li>You take longer than 20 minutes to complete the test.</li></ul>"},{"Node":"rootNavigation.driver.introduction.overviewOfDrivingTest","ImageName":"","Heading":"You will fail the road test if","Description":"<ul><li>You can work out the fail mark by taking your road test: duration in minutes and multiplying by 8. So if your test took 21 minutes, the maximum number of penalty points you can get before failing is 168.</li>\n<li>For any &#34;black box&#34; item</li></ul>"}]